ImGUI Test Engine, new zig-gamedev, cleanup
