--- a/Writerside/topics/manual/core/cdb.md
+++ b/Writerside/topics/manual/core/cdb.md
@@ -74,29 +75,31 @@ If property is changed (override) on instance and property is changed on prototy
 
 Obj1 is prototype for Obj2 and Obj2 is prototype for Obj3
 
-```mermaid
-classDiagram
-    class Obj1 {
-        +I64 prop1
-        +I64 prop2
-        +I64 prop3
-        +SUBOBJECT Prop2
-    }
+```d2
+Obj1: {
+    shape: class
 
-    class Obj2 {
-        +I64 prop1
-        +I64 prop2
-        +I64 prop3
-        +SUBOBJECT Prop2
-    }
+    prop1: "i64"
+    prop2: "i64"
+    prop3: "i64"
+}
 
-    class Obj3 {
-        +I64 prop1
-        +I64 prop2
-        +I64 prop3
-        +SUBOBJECT Prop2
-    }
+Obj2: {
+    shape: class
 
-    Obj3 --|> Obj2
-    Obj2 --|> Obj1
+    prop1: "i64"
+    prop2: "i64"
+    prop3: "i64"
+}
+
+Obj3: {
+    shape: class
+
+    prop1: "i64"
+    prop2: "i64"
+    prop3: "i64"
+}
+
+Obj3 -> Obj2
+Obj2 -> Obj1
 ```
