--- a/Writerside/topics/manual/core/kernel.md
+++ b/Writerside/topics/manual/core/kernel.md
@@ -10,14 +10,13 @@
 Kernel main loop call this phases for every tick.
 Phases is executed in this serial order one by one.
 
-```mermaid
-flowchart TB
-    OnLoad{OnLoad}
-    OnLoad-->PostLoad{PostLoad}
-    PostLoad-->PreUpdate{PreUpdate}
-    PreUpdate-->OnUpdate{OnUpdate}
-    OnUpdate-->OnValidate{OnValidate}
-    OnValidate-->PostUpdate{PostUpdate}
-    PostUpdate-->PreStore{PreStore}
-    PreStore-->OnStore{OnStore}
+```d2
+OnLoad
+OnLoad->PostLoad
+PostLoad->PreUpdate
+PreUpdate->OnUpdate
+OnUpdate->OnValidate
+OnValidate->PostUpdate
+PostUpdate->PreStore
+PreStore->OnStore
 ```
